# Position Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..Position Property
TextNode Class See Also
---
Position of the text in model coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Position { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Position As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Position {
	XYZ^ get ();
}
```

# Remarks
The relation of the position point with respect to the text area depends on the text alignment.
For example:
  * For Left-Top-aligned text the point is at the Left-Top corner of the box.
  * For Center-Bottom aligned text the point is at the Center-Bottom corner of the box.

# See Also
TextNode Class
Autodesk.Revit.DB Namespace